{
    "base_model_name_or_path": "Internlm-xcomposer-2-7b-vl-hf",
    "bias": "none",
    "enable_lora": null,
    "fan_in_fan_out": false,
    "inference_mode": true,
    "lora_alpha": 256.0,
    "lora_dropout": 0.05,
    "merge_weights": false,
    "modules_to_save": null,
    "peft_type": "LORA",
    "r": 256,
    "target_modules": [
      "q_proj",
      "v_proj",
      "k_proj",
      "o_proj",
      "gate_proj",
      "down_proj",
      "up_proj"
    ],
    "task_type": "CAUSAL_LM"
  }